//Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

//[345, 897, 568, 234] -> 2
//Console.WriteLine ("виводите число");
//int n = Convert.ToInt32(Console.ReadLine());
//void PrinArray ()
//{
  //   int[] array = new int [n];
    // for(int i = 0; i < n; i++)
    // {

      //   array[i] = Random.Shared.Next(0, 9);
       //  Console.WriteLine ("покажите число");

     //}
 

//}
//int[] myarray = PrinArray ()
//Console.WriteLine($"покажите трехзначни число {return} - {array} число");

//Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

//[3, 7, 23, 12] -> 19

//[-4, -6, 89, 6] -> 0
//int[] myArray = {};
 //myArray = new int [1];
//myArray[1] = Random.Shared.Next(9, 99);
//myArray [1] = 3;
//int a = myArray [0];
//Console.WriteLine (myArray[0]);

//Задача 38: Задайте массив натуральных чисел. Найдите разницу между максимальным и минимальным элементов массива.

//[3 7 22 2 78] -> 76
//Console.WriteLine ("ведите размер масива");

int [] array = {2,4,6,8};

int[] myArray = new int [0];

Console.WriteLine(myArray.Max());
myArray[0] =1;
myArray [1] =2;
Console.ReadLine();
void PrinArray()
{
 
 int[] myArray = new int [1];
 Console.WriteLine(myArray.Min());
 PrinArray();

}